Revit 2027 API
FabricLocation Enumeration
 Fabric location in the host
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum FabricLocation
Public Enumeration FabricLocation
public enum class FabricLocation
type FabricLocation
Members
Member name | Value | Description
BottomOrInternal | 1 |  The fabric is on the bottom face of a floor host, or on the internal face of a wall host.
TopOrExternal | 0 |  The fabric is on the top face of a floor host, or on the external face of a wall host.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace